{
    "Silverstone": {
        "Lap Record": "1:33.401 by Mark Webber (2013)",
        "Circuit Length": "5.891KM",
        "First Grand Prix": "1950",
        "Race Distance": "306.198KM",
        "time": {
            "Practice 1": "10:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "14:00",
            "Race": "13:00"
        },
        "Number of Laps": "52",
        "description": "Like so many of England's racing circuits, Silverstone started life as an aerodrome. When the Second World War ended in 1945, England's other two circuits, Donington Park and the legendary Brooklands, had fallen into disrepair. And so it was that the outer taxiways and interconnecting runways of Silverstone became adopted by the Royal Automobile Club as the home for the British Grand Prix in 1948. The circuit was fast and challenging and in 1949 the shape was formed that remains the basis of the track to this day."
    },
    "Spielberg": {
        "Lap Record": "1:08.337 by Michael Schumacher (2003)",
        "Circuit Length": "4.326KM",
        "First Grand Prix": "1970",
        "Race Distance": "307.02KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "71",
        "description": "The story of the Austrian Grand Prix begins, as with most Grands Prix, with a local group of motor racing enthusiasts in the 1950s. They created a simple L-shaped circuit with cones and hay bales in the town of Zeltweg. The first race held there in 1958, for international sportscars, was won by Wolfgang von Trips in a Porsche, but though the remarkably bumpy track drew criticism from some, the circuit went on to hold two rounds of the Formula Two Championship in 1959 and 1960. The organisers, however, dreamed of hosting a Formula One race, and in 1961 and 1963, Zeltweg staged non-championship events, won by Innes Ireland and Jack Brabham respectively."
    },
    "Baku": {
        "Lap Record": "1:46.485 by Nico Rosberg (2016)",
        "Circuit Length": "6.003KM",
        "First Grand Prix": "2016",
        "Race Distance": "306.049KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "51",
        "description": "The 2016 season sees Azerbaijan become the latest addition to the Formula One calendar, with capital city Baku playing host to what claims to be the fastest street circuit of the season, on a layout designed by renowned F1 track architect Hermann Tilke."
    },
    "Monte Carlo": {
        "Lap Record": "1:17.939 by Lewis Hamilton (2016)",
        "Circuit Length": "3.337KM",
        "First Grand Prix": "1950",
        "Race Distance": "260.286KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "78",
        "description": "The Monaco Grand Prix is the one race of the year that every driver dreams of winning. Like the Indy 500 or Le Mans, it stands alone, almost distinct from the sport from which it was born. A combination of precision driving, technical excellence and sheer bravery is required to win in Monte Carlo, facets which highlight the differences between the great and the good in Formula One."
    },
    "Singapore": {
        "Lap Record": "1:47.187 by Daniel Ricciardo (2016)",
        "Circuit Length": "5.065KM",
        "First Grand Prix": "2008",
        "Race Distance": "308.828KM",
        "time": {
            "Practice 1": "10:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:30",
            "Race": "12:00"
        },
        "Number of Laps": "61",
        "description": "In 2008 Singapore had the honour of hosting the first night-time event in Formula One history. The inaugural Singapore Grand Prix proved a huge hit, staged on a new street circuit, with the city's famous skyline providing a truly spectacular backdrop."
    },
    "Sakhir": {
        "Lap Record": "1:31.447 by Pedro de la Rosa (2005)",
        "Circuit Length": "5.412KM",
        "First Grand Prix": "2004",
        "Race Distance": "308.238KM",
        "time": {
            "Practice 1": "11:00",
            "Qualifying": "15:00",
            "Practice 3": "12:00",
            "Practice 2": "15:00",
            "Race": "15:00"
        },
        "Number of Laps": "57",
        "description": "The 2004 Grand Prix of Bahrain marked the first ever round of the FIA Formula One World Championship to be held in the Middle East and the official culmination of a multi-million dollar project started back in September 2002 when the Kingdom of Bahrain signed a long-term deal to host the event.\n\nLocated at Sakhir, 30 km south-west of the island's capital, Manama, the Hermann Tilke designed circuit contains no less than five track layouts within one complex. Construction began in November 2002 and in the months prior to its March 2004 completion, work was going on around the clock. Over 12,000 tonnes of stone were used in the build, a third of it Welsh granite, chosen for the track surface due to its excellent adhesive qualities."
    },
    "Shanghai": {
        "Lap Record": "1:32.238 by Michael Schumacher (2004)",
        "Circuit Length": "5.451KM",
        "First Grand Prix": "2004",
        "Race Distance": "305.066KM",
        "time": {
            "Practice 1": "02:00",
            "Qualifying": "07:00",
            "Practice 3": "04:00",
            "Practice 2": "06:00",
            "Race": "06:00"
        },
        "Number of Laps": "56",
        "description": "The Shanghai International Circuit was designed as the race circuit for the new millennium. And the modern track, with its stunning architecture, has achieved its goal of becoming China's gateway to the world of Formula One racing since it debuted on the calendar in 2004."
    },
    "Monza": {
        "Lap Record": "1:21.046 by Rubens Barrichello (2004)",
        "Circuit Length": "5.793KM",
        "First Grand Prix": "1950",
        "Race Distance": "306.72KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "53",
        "description": "Monza is regarded by many as the embodiment of Formula One racing."
    },
    "Sochi": {
        "Lap Record": "1:39.094 by Nico Rosberg (2016)",
        "Circuit Length": "5.848KM",
        "First Grand Prix": "2014",
        "Race Distance": "309.745KM",
        "time": {
            "Practice 1": "07:00",
            "Qualifying": "12:00",
            "Practice 3": "09:00",
            "Practice 2": "11:00",
            "Race": "12:00"
        },
        "Number of Laps": "53",
        "description": "The Sochi circuit, located in the Black Sea resort of the same name, is the first purpose-built Formula One facility in Russia and hosted the country's inaugural Grand Prix in October 2014, in the same year that the city also stages the Winter Olympics."
    },
    "Catalunya": {
        "Lap Record": "1:21.670 by Kimi Räikkönen (2008)",
        "Circuit Length": "4.655KM",
        "First Grand Prix": "1991",
        "Race Distance": "307.104KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "66",
        "description": "The Formula One teams are no strangers to the Circuit de Barcelona-Catalunya (formerly known as the Circuit de Catalunya); not only have they raced there every year since 1991, they also conduct extensive testing at the venue."
    },
    "Melbourne": {
        "Lap Record": "1:24.125 by Michael Schumacher (2004)",
        "Circuit Length": "5.303KM",
        "First Grand Prix": "1996",
        "Race Distance": "307.574KM",
        "time": {
            "Practice 1": "01:30",
            "Qualifying": "06:00",
            "Practice 3": "03:00",
            "Practice 2": "05:30",
            "Race": "05:00"
        },
        "Number of Laps": "58",
        "description": "When Formula One came to Australia in 1985 it set up home in Adelaide. However, ex-racer-turned-entrepreneur Bob Jane wanted a race in Melbourne. He created a huge 'thunderdome' and invented the AUSCAR series, bringing NASCAR action to Australia.\n\nThe desire to have a race in Melbourne did not wane. Despite the popular end of season slot for the Adelaide race, pressure was growing from the Melbourne motor sport community, and in 1992 Jeff Kennett was elected the new premier of the State of Victoria. He immediately set about improving Melbourne's profile. First on his list was the Australian Grand Prix."
    },
    "Hockenheim": {
        "Lap Record": "1:13.780 by Kimi Räikkönen (2004)",
        "Circuit Length": "4.574KM",
        "First Grand Prix": "1970",
        "Race Distance": "306.458KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "67",
        "description": "The original Hockenheim circuit was built in 1939 as a high-speed test track for Mercedes-Benz, who needed a venue to test for the Tripoli Grand Prix. It was almost eight kilometres long and was formed of two long, curved straights with a long corner at either end."
    },
    "Budapest": {
        "Lap Record": "1:19.071 by Michael Schumacher (2004)",
        "Circuit Length": "4.381KM",
        "First Grand Prix": "1986",
        "Race Distance": "306.63KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "70",
        "description": "Hungary first hosted a Grand Prix in the 1930s, but following the Second World War and the building of the Iron Curtain it was not until the 1960s that motorsport began to find a place in the country."
    },
    "Spa-Francorchamps": {
        "Lap Record": "1:47.263 by Sebastian Vettel (2009)",
        "Circuit Length": "7.004KM",
        "First Grand Prix": "1950",
        "Race Distance": "308.052KM",
        "time": {
            "Practice 1": "08:00",
            "Qualifying": "12:00",
            "Practice 3": "09:00",
            "Practice 2": "12:00",
            "Race": "12:00"
        },
        "Number of Laps": "44",
        "description": "Belgium's Spa-Francorchamps circuit is among the most historic on the Formula One calendar, having hosted a (non-championship) Grand Prix as long ago as 1924, and remains one of the most popular venues with drivers and fans alike."
    },
    "Mexico City": {
        "Lap Record": "1:20.521 by Nico Rosberg (2015)",
        "Circuit Length": "4.304KM",
        "First Grand Prix": "1963",
        "Race Distance": "305.354KM",
        "time": {
            "Practice 1": "16:00",
            "Qualifying": "19:00",
            "Practice 3": "16:00",
            "Practice 2": "20:00",
            "Race": "19:00"
        },
        "Number of Laps": "71",
        "description": "As the name suggests, the history of Mexico's Autodromo Hermanos Rodriguez is interwoven with that of brothers Ricardo and Pedro Rodriguez. It was the former's emergence in 1961, driving for Ferrari aged just 19, that provided the spark, prompting the decision to build a 5-kilometre circuit in the public Magdalena Mixhuca park in the east of Mexico City. And it was the latter's success later that decade which helped build an incredibly fervent home support for the event."
    },
    "Suzuka": {
        "Lap Record": "1:31.540 by Kimi Räikkönen (2005)",
        "Circuit Length": "5.807KM",
        "First Grand Prix": "1987",
        "Race Distance": "307.471KM",
        "time": {
            "Practice 1": "01:00",
            "Qualifying": "06:00",
            "Practice 3": "03:00",
            "Practice 2": "05:00",
            "Race": "05:00"
        },
        "Number of Laps": "53",
        "description": "One of the greatest tracks used in Formula One racing today, Japan's Suzuka circuit is a massive test of car and driver ability."
    },
    "Montreal": {
        "Lap Record": "1:13.622 by Rubens Barrichello (2004)",
        "Circuit Length": "4.361KM",
        "First Grand Prix": "1978",
        "Race Distance": "305.27KM",
        "time": {
            "Practice 1": "15:00",
            "Qualifying": "18:00",
            "Practice 3": "15:00",
            "Practice 2": "19:00",
            "Race": "19:00"
        },
        "Number of Laps": "70",
        "description": "In the 1960s the rivalry between French and English speaking Canada meant that the country's Grand Prix had two homes: Mosport Park one year and Mont-Tremblant the next. By 1970, however, Mont-Tremblant was deemed too dangerous and the race moved full time to Mosport Park."
    },
    "Sao Paulo": {
        "Lap Record": "1:11.473 by Juan Pablo Montoya (2004)",
        "Circuit Length": "4.309KM",
        "First Grand Prix": "1973",
        "Race Distance": "305.909KM",
        "time": {
            "Practice 1": "13:00",
            "Qualifying": "17:00",
            "Practice 3": "14:00",
            "Practice 2": "17:00",
            "Race": "17:00"
        },
        "Number of Laps": "71",
        "description": "In 1938 a huge plot of land was bought in Sao Paulo by two local property developers who intended to build a large housing development. It soon became clear, however, that one part of the land was not suitable for housing and so they decided to build a racing circuit instead. Sao Paulo grew at an incredible speed though and soon the circuit was surrounded by houses."
    },
    "Yas Marina": {
        "Lap Record": "1:40.279 by Sebastian Vettel (2009)",
        "Circuit Length": "5.554KM",
        "First Grand Prix": "2009",
        "Race Distance": "305.355KM",
        "time": {
            "Practice 1": "09:00",
            "Qualifying": "13:00",
            "Practice 3": "10:00",
            "Practice 2": "13:00",
            "Race": "13:00"
        },
        "Number of Laps": "55",
        "description": "Abu Dhabi is a city on the move. Not content with enjoying one of the world's richest oil reserves, the region has recently thrown itself into a massive programme of development. And one of the jewels in Abu Dhabi's crown is the 5.55-kilometre Yas Marina Circuit, which on November 1, 2009, hosted the country's inaugural Grand Prix. It was also the first F1 twighlight race, with powerful lighting ensuring a seamless transition from day to night."
    },
    "Kuala Lumpur": {
        "Lap Record": "1:34.223 by Juan Pablo Montoya (2004)",
        "Circuit Length": "5.543KM",
        "First Grand Prix": "1999",
        "Race Distance": "310.408KM",
        "time": {
            "Practice 1": "02:00",
            "Qualifying": "09:00",
            "Practice 3": "06:00",
            "Practice 2": "06:00",
            "Race": "07:00"
        },
        "Number of Laps": "56",
        "description": "In the mid 1990s, Malaysia was undergoing a huge change. Dr Mahathir Mohamad, Malaysia's Prime Minister was determined that by 2020, the country would be a fully industrialised nation. The best way to do this, it was thought, was through the auto trade.\n\nThe nation's number one oil company, Petronas, began investing heavily in Formula One with Sauber, and Malaysia's national car company, Proton, bought Lotus Engineering."
    },
    "Austin": {
        "Lap Record": "1:39.347 by Sebastian Vettel (2012)",
        "Circuit Length": "5.513KM",
        "First Grand Prix": "2012",
        "Race Distance": "308.405KM",
        "time": {
            "Practice 1": "16:00",
            "Qualifying": "19:00",
            "Practice 3": "16:00",
            "Practice 2": "20:00",
            "Race": "20:00"
        },
        "Number of Laps": "56",
        "description": "The 2012 season saw Formula One racing return to the United States for the first time since 2007 with an all-new venue in Austin, Texas. The Circuit of The Americas (COTA) is the first purpose-built F1 facility in the US designed for any and all classes of racing and was officially opened on October 21, 2012 by COTA ambassador and 1978 F1 world champion, Mario Andretti."
    }
}